# # Задание 1 
# Переменная - это адрес на который указывает переменная в физической памяти, используется для доступа к данным, а данные находящиеся в переменной называются значением этой переменной.
# Типизация данных:
# Статическая - давая значение переменной мы не можем изменит его тип данных(но благодаря этому способу мы тратим меньше ресурсов и времени)
# Динамическая - автоматически определяется тип переменной по значению + можем изменять тип переменной просто изменив значение на любое другое

# # Задание 2
# int - целые числа
# float - числа с плавающей точкой
# string - текст
# boolean - true/false


# # Задание 3
# C = 30
# F = C * 9/5 + 32
# K = C + 273.15
# print('Градусы Фаренгейта:', F)
# print('Градусы Кельвина:', K)



# # Задание 4
# dollar_rub = 100 * 90
# euro_rub = 100 * 100
# print('Доллары:', dollar_rub)
# print('Евро:', euro_rub)


# # Задание 5
# km = int(input('Введите расстояние в километрах'))
# print('Конвертация в метры:\t', km * 1000,'метров')
# print('Конвертация в мили:\t', km * 0.62,'мили')